num0 = 49
num1 = 46
num2 = 12
num3 = 8
num4 = 8
print(int(num0 + 25))
print(int(num1 + 25))
print(int(num2 + 25))
print(int(num3 + 25))
print(int(num4 + 25))
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
name = input("enter your name please : ")
print(type(name))
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
name = input("please enter your age : ")
print(str(name))
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# int (integer) გადააქცევს ყველაერს int-ად მაგრამ თუ ასოებს ჩაწერ int-ში მაშინ ერრორს გამოიწვევს
# str (string) გადააქცევს ყველაფერს სიდყვებათ მაგ: 12(int) გადააქცევს 12(str)
# float ეს გადააქცევს ყველა რიცხვს ათწილადად მაგ: 12(int) გადააქცევს 12.0(float)