// )შექმენით ორი სია, პრიველში დაამატეთ 10 ცალი ცაიფრი მეორეში 10 ცალი სტრინგი, შემდეგ ეს ორი სია გაერთიანეთ ერთ სიაში მეთოდის საშუალებით, შემდეგ delete ით შეცვალეთ მეხუთე ინდექსზე მდგომი ელემენტი undefined ით,  შემდეგ სიიდან ამოაგდეთ ბოლო ელემენტი, შემდეგ ამოაგდეთ პირველი ელემენტი და პირველ ინდექსზე ჩასვით "ვანო",  შემდგომბოლოშ ჩაამატეთ ერთი ელემენტი "მოთიაშვილი", საბოლოოდ გამოიტანეთ ეს მთლიანი სია გადაქცეული სტრინგად (დაიხმარეთ რესურსები)
let myArr = [1,2,3,4,5,6,7,8,9,10]
let myArr1 = ["a","b","c","d","e","f","g","h","i","j"]
let resultArr = myArr.concat(myArr)
delete(resultArr[5])
resultArr.pop
resultArr.shift
resultArr.unshift("ვანო")
resultArr.push("მოთიაშვილი")
console.log(resultArr.toString)