// .toString - გადააქცევს სიას 1 გრძელ სტრინგად და ერთმანეთს დაყოფს მძიმეებით --> ([საბა,სანაია].toString -"საბა,სანაია")

// .length - გამოაქვს სიის ელემენტების რაოდენობა --> ([საბა,სანაია].length -> 2)

// .at - იმ ელემენტს გამოიტანს რომლის ინდექსაც მივუთითავთ --> ([საბა,სანაია].at(1) - სანაია)

// .join() - გადააქვს სია ერთ დიდ სტრინგად მაგრამ რასაც გადავცემთ იმით გამოყოფს ერთმანეთს ელემენტებს --> ([საბა,სანაია].join("_") - "საბა_სანაია")

// .push - რასაც გადავცემთ იმას დაამატებს სიის ბოლოში --> ([საბა,სანაია].push(13) --> [საბა,სანაია,12])

// .pop - სიიდან შლის ყველაზე ბოლო ელემენტს ([საბა,სანაია).pop - [საბა])

// .shift - სიიდან აგდებს პირველ ელემენტს ([საბა,სანაია].shift - [სანაია])

// .unShift() - რასაც გადავცემთ იმას სიაში პირველ ინდექსზე ჩაამატებს ([საბა,სანაია].unShift(12) - [12,საბა,სანაია])

// .concat() - აერთებს 2 სიას და ქმნის ახალ სიას 
// -========================================================================================================================================================-

// 3)
let myArr = [1,2,3,4,5,6,7,8,9,10]
let myArr1 = ["a","b","c","d","e","f","g","h","i","j"]
let resultArr = myArr.concat(myArr1)
delete(resultArr[5])
resultArr.pop
resultArr.shift
resultArr.unshift("ვანო")
resultArr.push("მოთიაშვილი")
console.log(resultArr.toString)

// =================================================================================================================================================================

// 4

let myArr3 = [1,2,3,4,5,6,7,8,9,10]
let myArr4 = ["a","b","c","d","e","f","g","h","i","j"]
let myArr5 = [1,3,5,12,4,23,532,234]

let resultArr1 = myArr3.concat(myArr4)
let resultArr2 = resultArr1.concat(myArr5)
resultArr2.splice(2,5)
delete(resultArr2(3))

console.log(resultArr2)

