num1 = 25
num2 = 304

print(num2 + num1) #ეს ოპერაცია მიამატებს num2(304) და num1(25) ერთმანეთზე
print(num2 * num1) #ეს ოპერაცია გაამრავლებს num2 და num1 ერთმანეთზე
print(num2 - num1) #ეს ოპერაცია გამოაკლებს num2 და num1 ერთმანეთზე
print(num2 / num1) #ეს ოპერაცია გაყოფს num2 და num1 ერთმანეთზე
print(num2 * num1 + num2 / num1 - num2)

# + მიმატება
# - გამოკლება
# / გაყოფა
# * გამრავლება

#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
my_age = 12
my_age_in_5_years = 17
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
parent_age = 47 # მშობლის ასაკი
my_age = 12 # ჩემი ასაკი
print(parent_age * my_age)
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
my_age = 12
parent_age = 47
parent_age2 = 49
age = 8
age2 = 8
print(my_age + 2)
print(parent_age + 2)
print(parent_age2 + 2)
print(age + 2)
print(age2 + 2)
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
name = "saba"
name = "demetre"
print(name)