// 1) JS'ში შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს ასევე HTML'ში შექმენით ერთი ღილაკი ღილაკზე დაადეთ მოვლენის მსმენელი და დაკლიკების დროს კონსოლში გამოიტანეთ Hello {name}!
let name1 = prompt("enter your name")
const btn = document.getElementById("btn")

btn.addEventListener("click",function(){
    console.log(`hello ${name1}`)
})
// 2) კომენტარის სახით ვრცლად ახსენით დღეს ნასწავლი სკოუპები და შეეცადეთ გააკეთოთ მაგალითებიც.

// 3) HTML' ში შექმენით ერთი ღილაკი JS 'ში კი ერთი გლობალური ცვლადი num რომელსაც გაუტოლებთ თავიდან ნულს, შემდეგ კი JS 'ში აიდის მეშვეობით წამოიღეთ ღილაკი ამ ღილაკზე კი დაადეთ მოვლენის მსმენელი და ყოველი დაკლიკების დროს ცვლადის მნიშვნელობას დაუმატეთ 2 და გამოიტანეთ კონსოლში

// 4) შექმენით სარეგისტრაციო ფორმა თქვენთვის სასურვლეი ინფუთებით და submit ინფუთით შემდეგ JS 'ში აიდის საშუალებით წამოიღეთ ეს ინფუთი და დაადეთ მოვლენის მსენელი რომელიც დაკლიკების დროს გამოიტანს alert'ს "Registration completed successfully."
