# 1)კომენტარებით ახსენით განსხვევება indexing-სა და sliceing-ს შორის.
# indexing არის როდესაც ლისტიდან ერთ ელემენტს ვიღებთ print(num[1])
# slicing არის როდესაც ბევრ ელემენტს ერთად ვიღებთ print(num[1:5])
#------------------------------------------------------------------------------------------------------------------------------------
# 2)შექმენით სია სადაც გექნებათ 5 ელემენტი და მინუს ინდექსების გამოყენებით გამოიტანეთ ბოლო 3 ელემენტი
num = [1,2,3,4,5]
print(num[-3:5])
#------------------------------------------------------------------------------------------------------------------------------
# 3)შექმენით სია სადაც გექნებათ 10 რიცხვი, for გადაუარეთ ამ სიას და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია ან ტოლია 10ზე
nums = [20,39,2,24,1,22,383,12,3,10]
for num in nums:
    if num >= 10:
        print(num)
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 4)კომენტარის სახით ახსენით რა არის ფუქნცია, რაში ვიყენებთ და ჩამოწერეთ ყველა ნასწავლი ფუნქცია (გვერდით მიუწერეთ მათი დანიშნულება)
# type() წერს ვარუაბლის ტიპს
# input() აძლევს ადამიანს ის უფლება რომ დაწეროს რამე
# print() რასაც ჩაწერ იმას გამოაჩენს ტერმინალში
# range() ამეორებს ადამიანს მიერ ჩაწერილ რიცხვებს
# int() ყველაფერს აქცევს რიცხვად
# str() ყველაფერს აქცევს სიტყვად
# float() ყველაფერს აქცევს ათწილადად
# upper() ყველაფერს შეცვლის დიდ ასოებად
# lower() ყველაფერს შეცვლის პატარა ასოებად
#=-----------------------------------------------------------------------------------------------------------------------------=#
# 5)(***BOSS LEVEL***) მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ უნდა თუ არა რომ მისი გვარი გადაიყვანოს დიდ ასოებად, თუ გიპასუხათ "yes" მაშინ დაუბეჭდეთ მისი სახელი დიდი ასოებით, თუ გიპასუხათ "no" დაუბეჭდეთ უბრალოდ მისი სახელი. (მინიშნება: გაკვეთილის ბოლოს განვიხილეთ ზედაპირულად)
surname = input("please enter your surname: ")
option = input("would you like your surname in all caps? yes or no: ")
if option == "yes":
    print(surname.upper())
elif option == "no":
    print(surname.lower())
else:
    print("ERROR:4422342543")
    