// 1) კომენტარის სახით ახსენით რა არის სკოუპები ვრცლად და დეტალურად ჩამოაყალიბეთ ყველაფერი თქვენივე სიტყვებით 

// 2) შექმენი ცვლადი name გლობალურ სკოუპში და გამოიყენე ის ფუნქციის შიგნით ასევე კომენტარის სახით ახსენით რატომ შეგვიძლია მისი გამოყენება ყველგან 
let name1 = "hello"
function(hey){
    return name1 //name-ის ფუნქციაში გამოყენება იმიუტომ შეგვიძლია რომ name1 მიეკუთვნება გლობალურ სკოუპეს (global scope)
}
// 3) ფუნქციის შიგნით შექმენი ცვლადი message და სცადე მისი გამოყენება გარეთ და ასევე კომენტარის სახით ახსენით რატომ ვერ ვიყენებთ მას ფუნქციის გარეთ 
function(hi){
    let message = "hi"
    return message // <- ამ varuable-ის გამოყენება ფუნქციის გარეთ იმიტომ არ შეგვიძ₾ია რომ გამოვიყენოთ რომ ეს varuable-ი არიშ შექმნილი თვითონ ფუნქციაში და ამიტომ ეს მიეკუთვნება ფუნქციას
}
console.log(message)
// 4) შექმენი ფუნქცია რომელსაც შიგნით კიდევ ერთი ფუნქცია გააჩნია და შიდა ფუნქციაში გამოიყენე გარე ფუნქციის ცვლადი კომენტარის სახით ახსენით რატომ შეგვიძლია გარე ფუნქციის შიდა ფუნქციაში გამოყენება 
function(){
    let message2 = "hello again"
    function(){
        return message2 //  გარე ფუნქციის ცვლადის შიდა ფუნქციაში გამოყენება იმიტომ შეიძება რომ გარე ფუნქციას მექუთვნება შდა ფუნქცია და ამიტომ რაც გარე ფუნქციაში წერია ის ყველაფერი შეიძლება გამოვიყენოთ  შიდა ფუნქციაში
    }
}

