# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
num = [1,2,3,4,5,6,7,8,9,10]
sum = 0
for i in num:
    sum *=i
print(sum)
# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.
num = [1,2,3,4,5,6,7,8,9,10]
print(num[0:8])
# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.
num = [1,20,24,68,5,9]
for i in num:
    if i > 5:
        print(i)
# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.
num = [1,2,3,4,5,6,7,8,9,10]
sum = 0
for i in num:
    sum +=i
print(sum)

# 5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით
# slicing~ით შეიძლება ლისტიდან იმ რიცხვიდან დავიწყოთ ჩამთვლა მაგ print(num[1:2])