# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი
names = ["saba","zauri","nika","giorgi","vano"]
names.pop(0)
names.pop(4)
print(names)
# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert() ამის მეშვეობით ჩვენ შეგვიზლია ლისტში სადაც გვინდა იქ ჩავამატოდ ახალი სტრინგი
# .append() ამის მეშვეობით ჩვენ შეგვიზლია ლისტის ბოლოში დავწეროთ ახალი სტრინგი
# .pop() ამის მეშვეობით ჩვენ შეგვიზლია ლისტის რომელიმე სტრინგი წავშალოთ
# .len() ამის მეშვეობით ჩვენ შეგვიზლია ლისტის სიგრზე ვნახოთ ანუ ვნახოთ რამდენი სტრინგია ლისტში


# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე
names = ["saba","zauri","nika","giorgi","vano"]
names.insert(1, "gia")
print(names)