// 1) კომენტარის სახით ახსენით თითოეული მეთოდი რომელც დღეს გავიარეთ 

// 2) კომენტარის სახით ახსენით რაში და როგორ გამოიყენება დღეს ნასწავლი ფუნქციები map'ი და filter'ი

// 3) შექმენით სია სადაც შეინახავთ თქვენთვის სასურველ 10 რიცხვს შემდეგ მაპის მეშვეობით გამოიტანეთ ლუწ ინდექსზე მდგომი ელემენტების ნამრავლი ხოლო კენტ ინდექსზე მდგომ რიცხვებს დაუმატეთ 5 და დააუბრენეთ მიღებული პასუხი

// 4) შექმენით სახელების სია და მაპის მეშვეობით გადაუარეთ ამ სიას შემდეგ კი გამოიტანეთ ჯერ ამ სიის ინდექსები შემდეგ კი ამ სიაში მყოფი ელემენტები 

// 5) ზემოთ შექმნილი რიცხვების სიას გადაუარეთ filter'ის მეშვეობით და შეამოწმეთ თუ მოცემული ელემენტის 2 ზე გაყოფისას მიღებული რიცხვი მეტია 20 ზე მაშინ დააბრუნეთ true სხვა შემთხვევაში false 

// 6) map ფუნქციასა და filter ფუნქციაზე გააკეთეთ 5-5 მაგალითი დღეს ნასწავლი მეთდების გამოყენებით და თითოეული მაგალითი დაწვრილებით ახსენით კომენტარის სახით