// 1) შექმენით სია რომელშიც შეინახავთ 8 თქვენთვის სასურველ რიცხვს შემდეგ map ფუნქციის გამოყენებით დააბრუნეთ სიის თოთოეული ელემენტი გამრავლებული თავისივე ინდექსზე
const list1 = ["1","2","3","4","5","6","7","8"]
const listresult = names.map((naame1,number1) => {
    return naame1 * number1
})


// 2) შექმენით სახელების სია და გამოიტანეთ მხოლოდ ლუწ ინდექსზე მდგომი სახელები map ფუნქციის გამოყენებით 
const listresult2 = list1.map((name2,number2) => {
    if(number2 % 2 == 1){
        return name2
    }
})
// 3) შექმენით რიცხვების სია სადაც შეინახავთ თქვენთვის სასურველ რიცხვებს შემდეგ map ფუნქციის გამოყენებით გადაუარეთ ამ სიას და დააბრუნეთ კენტ ინდექსზე მდგომი ელემენტების ჯამი 

// 4) შექმენით სახელების სია (შეგიძლიათ გამოიყენოთ წინა დავალებაშ შექმნილი სიაც) შემდეგ filter ფუნქციის გამოყენებით გადაუარეთ სიას და შეამოწმეთ თუ სახელის სიგრძე მეტი იქნება 4 ზე მაშინ დააბრუნეთ true სხვა შემთხვევაში false

// 5) გამოიყენეთ ზემოთ შექმნილი სახელების სია თუ ელემენტი დგას კენტ ინდექსზე მაშინ დააბრუნეთ true სხვა შემთხვევაში false

// 6) კომენტარის სახით ახსენით map და filter ფუნქციები