# 1)მომხმარებელს შემოატანინეთ მისი სახელი და თუ ეს სახელი უდრის თქვენს სახელს, დაბეჭდეთ "Hello" სხვა შემთხვევაში "Bye".
name = input("please enter your name")
name1 = "saba"
if name == name1:
    print("hello")
else:
    print("bye")
#------------------------------------------------------------------------------------------------------------------------------------------------
#2)ცვლადში შეინახეთ თქვენი საყვარელი რიცხვი და მომხმარებელს შემოატანინეთ ასევე მისი საყვარელი რიცხვი, თუ თქვენი რიცხვები ემთხვევა მაშინ დაბეჭდეთ "Perfect" თუ მისი რიცხვი მეტია, დაბეჭდეთ "More", სხვა შემთხვევაში "Less".

num = 12
num1 = int(input("please enter your favourite number"))
if num1 == num:
    print("perfect")
elif num1 > num:
    print("more")
else:
    print("less")

#-----------------------------------------------------------------------------------------------------------------------------------------------
#3)შექმენით for ციკლი 150ის დიაპაზონში და შეამოწმეთ თითოეული რიცხვი, თუ ეს რიცხვი არის ლუწი, მაშინ დაბეჭდეთ "Luwia" და გვერძე მიაწერეთ რიცხვი (მინიშნება ---> print("Luwia", i) ხოლო თუ იქნება კენტი, დაბეჭდეთ "Kentia" და გვერძე მიუწერეთ ეს რიცხვი.

for i in range (0,150,2):
    print("luwia",i)

for i in range (1,10,2):
    print("kentia",i)
#-----------------------------------------------------------------------------------------------------------------------------------------------
# 4)მომხმარებელს შემოატანინეთ მისი ასაკი და ასევე მისი სახელი, თუ მომხმარებლის სახელი ემთხვევა თქვენს სახელს და ასევე მისი ასაკი ემთხვევა თქვენს სახელს, დაბეჭდეთ "Twins" სხვა შემთხვევაში "Not Twins".

age = 12
name = "saba"
age1 = int(input("please enter your age"))
name1 = input("please enter your name")
if name == name1 and age == age1:
    print("twins")
else:
    print("not twins")
#------------------------------------------------------------------------------------------------------------------------------------------------
#5)შექმენით ცვლადი სადაც შეინახავთ ორიგინალ აქაუნთის პაროლს, და while ციკლის მეშვეობით მომხმარებელს შეეკითხეთ აქაუნთის პაროლი იქამდე სანამ სწორედ არ გამოიცნობს.
account_password = 12343
account_password_guess = int(input("please enter your password "))
while account_password != account_password_guess:
    print("incorrect")
    print("please try again")
    account_password_guess = int(input("please enter your password "))
print("welcome")

