# #1 შექმენით სია შემდგარი 5 ელემენტისგან და გამოიტანეთ ამ სიის თითოეული ელემენტი ინდექსებით
name = [1,2,3,4,5]
print(name[0])
print(name[1])
print(name[2])
print(name[3])
print(name[4])

#]------------------------------------------------------------------------------------------------------------------------------
#2)შექმენით სია შემდგარი 10 ელემენტისგან და გამოიტანეთ თითოეული ელემენტი for ციკლით / range() ფუნქციითაც და პირდაპირ ცვლადის გადაცემითაც
cars = ["toyota","BMW","porche","ferarri","bugatti","tesla","subaru","mersedes","audi","brabus"]
for i in range(10):
    print(cars[i])

for car in cars:
    print(car)
#==================================================================================================================================
#3]შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე
nums = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]
for num in nums:
    if num > 10:
        print(num)

# consoles = ["ps1","ps4","ps5"]
# for i in range(3):
#     print(consoles[i])
# i - ცვლადი 
# for - ამ შემთხვევაში forი სათითაოდ ანიჭებს i ცვლადს რიცხვებს რასაც გვაძლევს range ფუნქცია
# ეს for ლუპი ყოველ ჯერზე როდესაც i ცვლადი იღებს ახალ მნიშვნელობას ახალ რიცხვებიდან იშვება : შემდეგ დაწერილ კოდებს 
#~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~~-~-~
#4]შექმენით სია შემდგარი 7 განსხვავებული ემენეტისგან და for ციკლის მეშვეობით შეამოწმეთ თითოეული ემენეტის მონაცემთა ტიპი
numbers = [12,13.12,78,"24",72,"124",9.0]
for number in numbers:
    print(type(number))