// 1) კომენტარის სახით ახსენით რაში გამოიყნება addEventListener'ი 

// addEventListener გამოიყენება იმისტვის რომ მოვლენის შემდეგ რამე მოხწდეს

// 2) JS'ში შექმენით ცვლადი სადაც შეინახავთ თქვენთვის სასურველ რიცხვს 10'ის ფარგლებში ასევე შექმენით ერთი ცვლადი სადაც მომხმარებელს შემოატანინებთ რიცხვს შემდეგ HTML'ში შექმენით ერთი button რომელსაც წამოიღებთ JS'ში და დაადებთ მოვლენის მსმენელს ღილაკზე დაკლიკების დროს თუ მომხმარებლის რიცხვი დაემთხვევა თქვენს რიცხვს ალერტით გამოიტანეთ "შენ გამოიცანი ჩემი რიცხვი" თუ არა მაშინ "შენ ვერ გამოიცანი ჩემი რიცხვი"
const btn = document.getElementById("btn")
let number = 3
let enter_number = prompt("enter a number from 1 - 10")
btn.addEventListener("click",function(e){
    e.preventDefault
    if(enter_number === number){
        alert("შენ გამოიცანი ჩემი რიცხვი")
    }
    else if(enter_number != number){
        alert("შენ ვერ გამოიცანი ჩემი რიცხვი")
    }
})
