// 1) for ციკლის დახმარებით დაბეჭდეთ ლუწი რიცხვები 1-დან 50-მდე.
for(let i = 0; i < 50;i=i+2){
    console.log(i)
}
// 2) შექმენით ობიექტი, რომელშიც key და იქნება სახელი, გვარი, ასაკი და value-ები შესაბამისი მნიშვნელობები. თქვენი დავალებაა for in iterator-ის დახმარებით დაბეჭდოთ ობიექტში მყოფი key და value.
name1 = {
    name: "saba",
    age: 13,
}
for(let i in name1){
    console.log(i)
}
// 3) შექმენით 6 ელემენტიანი რიცხვების სია, თქვენი დავალებაა for of iterator-ის დახმარებით დაბეჭდოთ სიაში მყოფი მხოლოდ კენტი რიცხვები.

list1 = [1,2,3,4,5,6]
for(let i of list1){
    console.log(i)
}