// 1) შექმენით სია სადაც შეინახავთ რიცხვებს და შემდეგ გადაუვლით foreach ის საშუალებით და გამოიტანეთ თითოეული რიცხვი სიიდან
let list1 = [1,2,3,4,5]
list1.forEach(() =>{})
// 2) გამოიყენეთ ზემოთ შექმნილი სია და კონსოლში გამოიტანეთ ამ რიცხვების კვადრატი 

// 3) შექმენით სახელების სია სადაც შეინახავთ თქვენთვის სასურველ სახელებს შემდეგ ამ სიას გადაუარეთ foreach ის საშუალებით და კონსოლში დაბეჭდეთ "hello 'name' " 

// 4) ზემოთ შექმნილი რიცხვების სიიდან foreach ის საშუალებით გადაუარეთ ამ სიას და კონსოლში დააბრუნეთ ელემენტებისა და ინდექსების ჯამი 

// 5) შექმენით ცვლადი სადაც შეინახავთ ცხოველებს და გამოიტანეთ რომელ ინდექსზე რომელი ცხოველი დგას 

// 6) შექმენით სია სადაც შეინახავთ ობიექტებს (animal, sound.  key/values) შემდეგ გადაუარეთ ამ სიას foreach'ის საშუალებით და საიტზე div'სა და p'ის გამოყენებით გამოსახეთ სიის თითოეული ელემენტი 1) შექმენით სია სადაც შეინახავთ რიცხვებს და შემდეგ გადაუვლით foreach ის საშუალებით და გამოიტანეთ თითოეული რიცხვი სიიდან
