# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiplied(num1,num2):
    return num1 * num2
print(multiplied(345,2))
# --------------------------------------------------------------------------------------------
# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.
# isalnum ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს რიცხვი მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც რიცხვის გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# isdigit ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს digit-ები მაგ: £,<,>,$,%,@, ა ასე შემდეგ. მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც digit-ის გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# islower ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს ყველა ასო lower case-ში მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც ყველა ასოდან ერთი მაინც upper case-ი იქნება  მაშინ false-გამოიტანს

# isnumeric ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს რომაული რიცხვები(roman numericals) მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც რომაული რიცხვების გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# isupper ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს ყველა ასო დიდ ასოებად დაწერილი მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც დიდ ასოების გარდა მაგალითად lower case ასო წერია მაშინ false-გამოიტანს

# count ეს თვლის რამდენი ისეთი ასოა სტრინგში

# --------------------------------------------------------------------------------------------
# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები
#min აპატარავებს ყველა ასოს სტრინგში
#max ადიდებს ყველა ასოს სტრინგში
# -------------------------------------------------------------------------------------------- 