# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiplied(num1,num2):
    return num1 * num2
print(multiplied(345,2))
# --------------------------------------------------------------------------------------------
# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.
# isalnum ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს რიცხვი და ასოები თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც რიცხვის და ასოების გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# isdigit ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს რიცხვები ხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც  რიცხვების გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# islower ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს ყველა ასო lower case-ში მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც ყველა ასოდან ერთი მაინც upper case-ი იქნება  მაშინ false-გამოიტანს

# isnumeric ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს რიცხვები ხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც  რიცხვების გარდა სხვა რამე წერია მაშინ false-გამოიტანს

# isupper ეს ფუნქცია ამოწმებს სტრინგს თუ მას აქვს ყველა ასო დიდ ასოებად დაწერილი მხოლოდ თუ ეს შესრულებულია მაშინ true-ს დაწერს მაგრამ როდესაც დიდ ასოების გარდა მაგალითად lower case ასო წერია მაშინ false-გამოიტანს

# count გვიბრუნებს სტრინგში იმ სიმბოლოს რაოდენობას 

# --------------------------------------------------------------------------------------------
# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები
#min წერს ყველაზე პატარა რიცხვს ლისტიდან
#max წერს ყველაზე დიდ რიცხვს ლისტიდან
# -------------------------------------------------------------------------------------------- 